In [1]:
people = {
    'name' : ['Mary', 'Helen', 'Warren', 'Leo'],
    'surname' : ['Williams', 'Thomas', 'Scott', 'Nelson'],
    'email' : ['marry.w@gamil.com', 'helen.t@gmail.com', 'warren.s@mail.ru', 'leo.n@yandex.ru']
}

In [2]:
import pandas as pd
df = pd.DataFrame(people)

In [3]:
df

     name   surname              email
0    Mary  Williams  marry.w@gamil.com
1   Helen    Thomas  helen.t@gmail.com
2  Warren     Scott   warren.s@mail.ru
3     Leo    Nelson    leo.n@yandex.ru

In [4]:
df.columns

Index(['name', 'surname', 'email'], dtype='object')

In [5]:
df.columns = ['first_name', 'last_name', 'email']

In [6]:
df

  first_name last_name              email
0       Mary  Williams  marry.w@gamil.com
1      Helen    Thomas  helen.t@gmail.com
2     Warren     Scott   warren.s@mail.ru
3        Leo    Nelson    leo.n@yandex.ru

In [7]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME              EMAIL
0       Mary  Williams  marry.w@gamil.com
1      Helen    Thomas  helen.t@gmail.com
2     Warren     Scott   warren.s@mail.ru
3        Leo    Nelson    leo.n@yandex.ru

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name              email
0       Mary  Williams  marry.w@gamil.com
1      Helen    Thomas  helen.t@gmail.com
2     Warren     Scott   warren.s@mail.ru
3        Leo    Nelson    leo.n@yandex.ru

In [9]:
df.columns = df.columns.str.replace('_', ' ' )
df

  first name last name              email
0       Mary  Williams  marry.w@gamil.com
1      Helen    Thomas  helen.t@gmail.com
2     Warren     Scott   warren.s@mail.ru
3        Leo    Nelson    leo.n@yandex.ru

In [10]:
df.rename(columns = {'first name' : 'name', 'last name': 'surname'})

     name   surname              email
0    Mary  Williams  marry.w@gamil.com
1   Helen    Thomas  helen.t@gmail.com
2  Warren     Scott   warren.s@mail.ru
3     Leo    Nelson    leo.n@yandex.ru

In [11]:
df.rename(columns = {'first name' : 'name', 'last name': 'surname'}, inplace = True)

In [12]:
df

     name   surname              email
0    Mary  Williams  marry.w@gamil.com
1   Helen    Thomas  helen.t@gmail.com
2  Warren     Scott   warren.s@mail.ru
3     Leo    Nelson    leo.n@yandex.ru

In [13]:
df.loc[2]

name                 Warren
surname               Scott
email      warren.s@mail.ru
Name: 2, dtype: object

In [14]:
df.loc[2] = 'Candy', 'Mitchell', 'candy.m@gmail.com'

In [15]:
df

    name   surname              email
0   Mary  Williams  marry.w@gamil.com
1  Helen    Thomas  helen.t@gmail.com
2  Candy  Mitchell  candy.m@gmail.com
3    Leo    Nelson    leo.n@yandex.ru

In [16]:
df.loc[2, ['name', 'email']] = 'Robinson', 'robinson@gmail.com'

In [17]:
df

       name   surname               email
0      Mary  Williams   marry.w@gamil.com
1     Helen    Thomas   helen.t@gmail.com
2  Robinson  Mitchell  robinson@gmail.com
3       Leo    Nelson     leo.n@yandex.ru

In [18]:
df.loc[0, 'email'] = 'edulover@yeandex.ru'

In [19]:
df

       name   surname                email
0      Mary  Williams  edulover@yeandex.ru
1     Helen    Thomas    helen.t@gmail.com
2  Robinson  Mitchell   robinson@gmail.com
3       Leo    Nelson      leo.n@yandex.ru

In [20]:
df.at[0, 'email'] = 'marry.w@gamil.com'

In [21]:
df

       name   surname               email
0      Mary  Williams   marry.w@gamil.com
1     Helen    Thomas   helen.t@gmail.com
2  Robinson  Mitchell  robinson@gmail.com
3       Leo    Nelson     leo.n@yandex.ru

In [22]:
filt = df['email'] == 'kami.hamitova@yandex.ru'
df[filt]['name'] = 'Dana'

In [23]:
filt1 = df['name'] == 'Kamila'
df.loc[filt1, 'email'] = 'kamila.hamitova99@gmail.com'

In [24]:
df

       name   surname               email
0      Mary  Williams   marry.w@gamil.com
1     Helen    Thomas   helen.t@gmail.com
2  Robinson  Mitchell  robinson@gmail.com
3       Leo    Nelson     leo.n@yandex.ru

In [25]:
df['name'].str.lower()

0        mary
1       helen
2    robinson
3         leo
Name: name, dtype: object

In [26]:
df['name']=df['name'].str.lower()

In [27]:
df

       name   surname               email
0      mary  Williams   marry.w@gamil.com
1     helen    Thomas   helen.t@gmail.com
2  robinson  Mitchell  robinson@gmail.com
3       leo    Nelson     leo.n@yandex.ru

In [28]:
df['surname']=df['surname'].str.upper()
df['name']=df['name'].str.lower()
df

       name   surname               email
0      mary  WILLIAMS   marry.w@gamil.com
1     helen    THOMAS   helen.t@gmail.com
2  robinson  MITCHELL  robinson@gmail.com
3       leo    NELSON     leo.n@yandex.ru

In [29]:
df['email'].apply(len)

0    17
1    17
2    18
3    15
Name: email, dtype: int64

In [30]:
def upper_email(email):
    return email.upper()

In [31]:
df['email'] = df['email'].apply(upper_email)

In [32]:
df

       name   surname               email
0      mary  WILLIAMS   MARRY.W@GAMIL.COM
1     helen    THOMAS   HELEN.T@GMAIL.COM
2  robinson  MITCHELL  ROBINSON@GMAIL.COM
3       leo    NELSON     LEO.N@YANDEX.RU

In [33]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [34]:
df

       name   surname               email
0      mary  WILLIAMS   marry.w@gamil.com
1     helen    THOMAS   helen.t@gmail.com
2  robinson  MITCHELL  robinson@gmail.com
3       leo    NELSON     leo.n@yandex.ru

In [35]:
df['email'].apply(len)

0    17
1    17
2    18
3    15
Name: email, dtype: int64

In [36]:
len(df['email'])

4

In [37]:
df.apply(len)

name       4
surname    4
email      4
dtype: int64

In [38]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [39]:
df.apply(pd.Series.min)

name                   helen
surname             MITCHELL
email      helen.t@gmail.com
dtype: object

In [40]:
df.apply(lambda x: x.min())

name                   helen
surname             MITCHELL
email      helen.t@gmail.com
dtype: object

In [41]:
df.applymap(len)

   name  surname  email
0     4        8     17
1     5        6     17
2     8        8     18
3     3        6     15

In [42]:
df.applymap(str.lower)

       name   surname               email
0      mary  williams   marry.w@gamil.com
1     helen    thomas   helen.t@gmail.com
2  robinson  mitchell  robinson@gmail.com
3       leo    nelson     leo.n@yandex.ru

In [50]:
df['name'].map({'mary' : 'carla', 'leo':'steve'})

0    carla
1      NaN
2      NaN
3    steve
Name: name, dtype: object

In [44]:
df

       name   surname               email
0      mary  WILLIAMS   marry.w@gamil.com
1     helen    THOMAS   helen.t@gmail.com
2  robinson  MITCHELL  robinson@gmail.com
3       leo    NELSON     leo.n@yandex.ru

In [45]:
df['name'] = df['name'].replace({'Janat' : 'Oraz', 'duman':'Farukh'})
df

       name   surname               email
0      mary  WILLIAMS   marry.w@gamil.com
1     helen    THOMAS   helen.t@gmail.com
2  robinson  MITCHELL  robinson@gmail.com
3       leo    NELSON     leo.n@yandex.ru

In [46]:
df_public = pd.read_csv('survey_results_public.csv')
df_schema = pd.read_csv('survey_results_schema.csv')

In [47]:
df_public.rename(columns={'SurveyEase': 'SurveyLevel'}, inplace = True)
df_public.head(2)

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyLevel
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult

In [48]:
df_public['Hobbyist']= df_public['Hobbyist'].map({'Yes': True, 'No':False})

In [49]:
df_public

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyLevel
0,1,I am a student who is learning to code,True,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,False,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",True,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelors degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
3,4,I am a developer by profession,False,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
4,5,I am a developer by profession,True,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8486,8524,I am a developer by profession,True,Less than once per year,The quality of OSS and closed source software ...,"Independent contractor, freelancer, or self-em...",United Kingdom,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers,45.0,Man,No,Straight / Heterosexual,White or of European descent,Yes,Too long,Neither easy nor difficult
8487,8525,I am a developer by profession,True,Never,The quality of OSS and closed source software ...,Employed full-time,France,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Courses on technologies you're interested in,23.0,Man,No,Straight / Heterosexual,White or of European descent,No,Too long,Easy
8488,8526,I am a developer by profession,True,Less than once per year,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Nigeria,No,Associate degree,"A social science (ex. anthropology, psychology...",...,Just as welcome now as I felt last year,Courses on technologies you're interested in,26.0,Man,No,NaN,Black or of African descent,Yes,Appropriate in length,Easy
8489,8527,I am a developer by profession,False,Less than once per year,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Tech...,25.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
8490,8528,"I am not primarily a developer, but I write co...",False,Less than once a month but more than once per ...,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,United States,No,"Other doctoral degree (Ph.D, Ed.D., etc.)","A natural science (ex. biology, chemistry, phy...",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN